sources/Documents/ПроведениеАттестации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПроведениеАттестации</Name>
			<BasedOn>
				<xr:Item>Document.ПроведениеЗанятия</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Аттестация</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗанятий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАттестации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроведениеЗанятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОценкиСредние</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОценок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийБалл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПропусков</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредварительнаяАттестация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтоговаяОценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсправленнаяОценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

sources/Documents/ПроведениеАттестации/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПредметПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Группа) Тогда
	
		КолвоЗанятий = РаботаСКонтингентом.ПолучитьКоличествоПроведенныхЗанятий(Объект.Предмет,Объект.Группа, Объект.Дата);
		Если КолвоЗанятий < 3 Тогда
		
			 Сообщить("Занятий недостаточно для аттестации");
			
		Иначе
			 
			 Объект.КоличествоЗанятий = КолвоЗанятий; 
			 ВывестиТаблицуДанных();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредметПриИзменении(Элемент)
	ПредметПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ФормированиеНаСервере()
	Если ЗначениеЗаполнено(Объект.Предмет) Тогда
		
		Если ВнеплановаяДата Тогда
		
			КолвоЗанятий = РаботаСКонтингентом.ПолучитьКоличествоПроведенныхЗанятийВнеплановая(Объект.Предмет,Объект.Группа, Объект.ДатаНачала,Объект.ДатаОкончания);
		
		Иначе
		
			КолвоЗанятий = РаботаСКонтингентом.ПолучитьКоличествоПроведенныхЗанятий(Объект.Предмет,Объект.Группа, Объект.Дата);
		
		КонецЕсли;
		
		
		Если КолвоЗанятий < 3 Тогда
		
			 Сообщить("Занятий недостаточно для аттестации");
			 
		 Иначе
			 
			 Объект.КоличествоЗанятий = КолвоЗанятий;
			 
			 ВывестиТаблицуДанных();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	
КонецПроцедуры

&НаСервере
Процедура ВывестиТаблицуДанных()
	Если Объект.КоличествоЗанятий > 2 Тогда
		
		Если ВнеплановаяДата Тогда
		
			СтатистикаСтудентов = РаботаСКонтингентом.ПолучитьСтатистикуДляАттестации(Объект.Предмет,Объект.Группа,Объект.ДатаНачала,КонецДня(Объект.ДатаОкончания), ВыполнятьОтборПодгруппы);
		
		Иначе
		
			СтатистикаСтудентов = РаботаСКонтингентом.ПолучитьСтатистикуДляАттестации(Объект.Предмет,Объект.Группа,НачалоМесяца(Объект.Дата), КонецМесяца(Объект.Дата), ВыполнятьОтборПодгруппы);
		
		КонецЕсли;
		
		Для каждого студент Из СтатистикаСтудентов Цикл
		
			Стр = Объект.ОценкиСредние.Добавить();
			Стр.Студент = студент.Студент;
			Стр.КоличествоОценок = студент.КоличествоОценок;
			Стр.СреднийБалл = студент.СреднийБалл;
			Стр.КоличествоПропусков = студент.КоличествоПропусков;
			Если студент.КоличествоПропусков > Объект.КоличествоЗанятий/2 ИЛИ студент.КоличествоОценок < Окр(Объект.КоличествоЗанятий/2,0)-1 
				ИЛИ студент.СреднийБалл = 2 Тогда
			
				Стр.ПредварительнаяАттестация = "Неаттестован";
				Стр.ИтоговаяОценка = 2;
			
			Иначе 
				
				Стр.ПредварительнаяАттестация = "Аттестован";
				Стр.ИтоговаяОценка = Окр(студент.СреднийБалл,0);
				
			КонецЕсли;	
		КонецЦикла;
	
		Элементы.ОценкиСредние.Видимость = Истина;
	
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.КоличествоЗанятий > 0 Тогда
	
		 Элементы.ОценкиСредние.Видимость = Истина;
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВнеплановаяДатаПриИзменении(Элемент)
	Если ВнеплановаяДата Тогда
	
		Элементы.Группа2.Видимость = Истина;
	
	Иначе
	
		Элементы.Группа2.Видимость = Ложь;
	
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура Сформировать(Команда)
	ФормированиеНаСервере();
КонецПроцедуры


&НаСервере
Процедура СформироватьСписокПропущенныхТемНаСервере()
	Если ЗначениеЗаполнено(Объект.ДокументОснование) И Объект.Проведен Тогда
		
		ТабДок.Очистить();
		ПараметрОтбора = Новый Структура;
		ПараметрОтбора.Вставить("ИтоговаяОценка", 2);
		ПараметрОтбора.Вставить("ИсправленнаяОценка", 0);
		ТаблицаСтудентов = Объект.ОценкиСредние.Выгрузить(ПараметрОтбора, "Студент");
		
		МассивСтудентов = ТаблицаСтудентов.ВыгрузитьКолонку("Студент");
		
		
		//формирование макета

		Макет = Документы.ПроведениеАттестации.ПолучитьМакет("МакетСпискаТем");

		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		
		ОбластьПояснение = Макет.ПолучитьОбласть("Пояснение");
		ОбластьСтудент = Макет.ПолучитьОбласть("Студент");
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьДанные = Макет.ПолучитьОбласть("Данные");
		
		ОбластьЗаголовок.Параметры.Дата = Лев(Строка(ТекущаяДата()),10);
		ОбластьЗаголовок.Параметры.Месяц = ОбщиеФункции.ПолучитьНаименованиеМесяца(Объект.Дата);
		ТабДок.Вывести(ОбластьЗаголовок);
		ТабДок.Вывести(ОбластьПояснение);
		
		Для каждого Студент Из ТаблицаСтудентов Цикл
		
			  Темы = РаботаСКонтингентом.ПолучитьСписокПропущенныхТемСтудентомЗаМесяц(Объект.Группа,Объект.Предмет,
			  		Месяц(Объект.Дата),Объект.Дата, Студент.Студент);
			  
			  Если Темы.Количество() > 0 И Не Студент.Студент.Отчислен Тогда

			  	  ОбластьСтудент.Параметры.ФИО = Студент.Студент;
				  ТабДок.Вывести(ОбластьСтудент);
				  ТабДок.Вывести(ОбластьШапка);
				  Для каждого Тема Из Темы Цикл
				  
				  	   ОбластьДанные.Параметры.Дата = Тема.Дата;
					   ОбластьДанные.Параметры.Тема = Тема.Тема;
				       ТабДок.Вывести(ОбластьДанные);
					   
				  КонецЦикла;
			  
			  КонецЕсли;
			  
		     
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СформироватьСписокПропущенныхТем(Команда)
	
	СформироватьСписокПропущенныхТемНаСервере();

КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаписатьWordНаСервере(Группа, ТабДок, Предмет, Месяц)
	мес = ВРег(ОбщиеФункции.ПолучитьНаименованиеМесяца(Месяц));
	ИмяФайла = "Исправление_аттестации_" + Группа.Наименование + "_" + Предмет.Шифр + "_" + 
		мес + "_"+ Лев(Строка(ТекущаяДата()),10) + ".DOCX";
    Каталог = "C:/";
    ПолныйПутьКФайлу = Каталог + ИмяФайла;    
		
		ТабДок.Записать(ПолныйПутьКФайлу,ТипФайлаТабличногоДокумента.DOCX);
        ЗапуститьПриложение(ПолныйПутьКФайлу);

КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьWord(Команда)
	ЗаписатьWordНаСервере(Объект.Группа, ТабДок, Объект.Предмет, Объект.Дата);
КонецПроцедуры
